routes/admin.php

      Route::get('home', "MainController@index")->name('home');


      Route::get('/', function (){
          if(auth()->user()->rule == 'admin')
          {
            return redirect(route('admin.statics'));
          }else{
              $newStatus = Status::where('name_en','new')->first();
              return redirect(route('admin.home') .'?filter_status='.$newStatus->id);
          }
      });
---
select * from `statuses` where `name_en` = 'new' limit 1