app/DatabaseRecordsExport.php

select * from `users` where `users`.`id` = 222 and `users`.`deleted_at` is null limit 1
---
    public function query()
    {
      if(Request()->has('search')){
          $deals = DatabaseRecords::where('name','LIKE','%'. Request('search') .'%')->orderBy('id','desc');
      }else{
        if(auth()->user()->rule=='sales')
        {
           $deals = DatabaseRecords::where('user_id',auth()->id());
        }
        elseif(auth()->user()->rule=='sales admin uae')
        {
          $deals = DatabaseRecords::where('country_id',2);
        }
        elseif(auth()->user()->rule=='sales admin saudi')
        {
          $deals = DatabaseRecords::where('country_id',1);
        }
        elseif(auth()->user()->rule=='sales director')
        {
          $user=User::where('id',auth()->id())->first();