app/DatabaseRecordsExport.php

    public function map($deal): array
    {
      $country = $deal->country ? $deal->country->name : '';
      $created_by = $deal->creator ? $deal->creator->name : '';
      $assign_to = $deal->user ? $deal->user->name : '';
      $status=Status::where('id',$deal->status)->first();
---
select * from `statuses` where `id` = 2 limit 1