<?php
return [
  'stage' => [
    '1' => 'مستأجرة',
    '2' => 'شاغر عند التحويل',
    '3' => 'شاغر'
  ],
  'status' => [
    '1' => 'نشرت',
    '2' => 'غير منشورة',
    '3' => 'مسودة',
    '4' => 'ما زال يحتاج بتصدير',
    '5' => 'مؤرشف'
  ],
  'furnished' => [
    '1' => 'مفروشة، مد، زود',
    '2' => 'غير مفروش',
    '3' => 'غير محدد',
    '4' => 'نصف مفروش أو نصف مجهز أو شبه مفروش',
    '5' => 'مفروشة بالكامل'
  ],
  'cheques' => [
    '1' => '1 يفحص',
    '2' => '2 يفحص',
    '3' => '3 يفحص',
    '4' => '4 يفحص',
    '5' => '5 يفحص',
    '6' => '6 يفحص',
    '7' => '7 يفحص',
    '8' => '8 يفحص',
    '9' => '9 يفحص',
    '10' => '10 يفحص',
    '11' => '11 يفحص',
    '12' => '12 يفحص',
  ],
  'bathrooms' => [
    '1' => '1 حمام',
    '2' => '2 الحمامات',
    '3' => '3 الحمامات',
    '4' => '4 الحمامات',
    '5' => '5 الحمامات',
    '6' => '6 الحمامات',
    '7' => '7 الحمامات',
    '8' => '8 الحمامات',
    '9' => '9 الحمامات',
    '10' => '10 الحمامات',
    '11' => '11 الحمامات',
    '12' => '12 الحمامات',
  ],
  'bedrooms' => [
    '-1' => '-1',
    '1' => '1 سرير',
    '2' => '2 سرير',
    '3' => '3 سرير',
    '4' => '4 سرير',
    '5' => '5 سرير',
    '6' => '6 سرير',
    '7' => '7 سرير',
    '8' => '8 سرير',
    '9' => '9 سرير',
    '10' => '10 سرير',
    '11' => '11 سرير',
    '12' => '12 سرير',
  ],
  'price_type' => [
    '1' => 'سعر ثابت',
    '2' => 'السعر يبدأ من',
    '3' => 'اسأل عن السعر',
    '4' => 'قابل للتفاوض'
  ],
  'parking_areas' => [
    '1' => '1',
    '2' => '2',
    '3' => '3',
    '4' => '4',
    '5' => '5',
    '6' => '6',
    '7' => '7',
    '8' => '8',
    '9' => '9',
    '10' =>'10',
    '11' =>'11',
    '12' =>'12',
    '13' =>'13',
    '14' =>'14',
    '15' =>'15',
    '16' =>'16',
    '17' =>'17',
    '18' =>'18',
    '19' =>'19',
    '20' =>'20',
    '21' =>'21',
    '22' =>'22',
    '23' =>'23',
    '24' =>'24',
    '25' =>'25',
    '26' =>'26',
    '27' =>'27',
    '28' =>'28',
    '29' =>'29',
    '30' =>'30',
    '40' =>'40',
    '50' =>'50',
    '60' =>'60',
    '70' =>'70',
    '80' =>'80',
    '90' =>'90',
    '100' =>'100',
    '110' =>'110',
    '120' =>'120',
    '130' =>'130',
    '140' =>'140',
    '150' =>'150',
    '160' =>'160',
    '170' =>'170',
    '180' =>'180',
    '190' =>'190',
    '200' =>'200',
    '201' =>'200 زائد'
  ],
  'parking_type' => [
    '1' => 'المواقف المفتوحة',
    '2' => 'مواقف مغطاة للسيارات',
    '3' => 'مواقف سيارات مغلقة',
    '4' => 'مواقف السيارات العامة'
  ],
  'measure_unit' => [
    '1' => 'قدم مربع',
    '2' => 'متر مربع'
  ],
  'yes_no' => [
    '1' => 'نعم',
    '2' => 'لا'
  ],
  'fitted' => [
    '1' => 'تركيب',
    '2' => 'شبه جاهزة',
    '3' => 'شل و كور'
  ],
  'project_status' => [
    '1' => 'جاهز ثانوي',
    '2' => 'الثانوية على الخارطة',
    '3' => 'جاهز الابتدائية',
    '4' => 'أساسيات البيع على الخارطة'
  ],
  'financial_status' => [
    '1' => 'مرهون',
    '2' => 'نقدي'
  ],  
  'unverified_reason' => [
    '1' => 'المستندات الموقعة من الشركة مفقودة',
    '2' => 'المستندات منتهية الصلاحية',
    '3' => 'مستندات غير مكتملة',
    '4' => 'مدرج مع 3 وكلاء آخرين',
    '5' => 'لا توقيع',
    '6' => 'خارج المخطط',
    '7' => 'عدم تطابق التوقيع',
    '8' => 'الإدراج الداخلي'
  ],
  'portals' => [
    '1' => 'الباحث عن الممتلكات',
    '2' => 'مثلي الجنس',
    '3' => 'دوبيزل',
    '4' => 'موقع إلكتروني',
  ],
  'sale_rent' => [
    '1' => 'أُوكَازيُون',
    '2' => 'إيجار'
  ],
  'featured' => [
    '1' => 'غالي',
    '2' => 'متميز',
    '3' => 'حار'
  ],
  'feature_type' => [
    '1' => 'ميزات الوحدة',
    '2' => 'ميزات التطوير',
    '3' => 'أسلوب الحياة'
  ],  
  'furnished' => [
    '0' => 'لا',
    '1' => 'نعم',
    '2' => 'جزئيا'
  ],  
];
