app/helper/helpers.php

insert into `activities` (`contact_id`, `user_id`, `action`, `related_model`, `related_model_id`, `updated_at`, `created_at`) values (46865, 13, 'contact created', 'Contact', 46865, '2022-11-03 09:12:59', '2022-11-03 09:12:59')
---
function newActivity($contactID,$userID,$action,$model = null,$relatedModelID = null,$activityDate = null,$createdContact = false){

      $data = [
        'contact_id' => $contactID,
        'user_id' => $userID,
        'action' => $action,
        'related_model' => $model,
        'related_model_id' => $relatedModelID,
      ];

      if($activityDate){
        $data['date'] = $activityDate;
      }

      Activity::create($data);

insert into `history` (`module_name`, `module_id`, `user_id`, `request_type`, `old_data`, `update_data`, `other_details`, `created_at`, `updated_at`) values ('Project Developer', '16', 205, 'updated', '{\n    \"id\": 16,\n    \"name\": \"Al Mahdiyah\",\n    \"bank_name\": null,\n    \"iban\": null,\n    \"developer_logo\": null,\n    \"created_at\": \"2022-07-25T07:48:14.000000Z\",\n    \"updated_at\": \"2022-07-25T07:48:14.000000Z\"\n}', '{\n    \"name\": \"Al Mahdiyah\",\n    \"iban\": \"100000236\",\n    \"bank_name\": \"Test bank\",\n    \"developer_logo\": \"cd67bf267dacfba26caded66da13830d.jpg\",\n    \"updated_at\": \"2022-12-15T06:00:43.289890Z\"\n}', '', '2022-12-15 06:00:43', '2022-12-15 06:00:43')
---
function addHistory($module_name,$module_id,$request_type,$update_data=null,$old_data=null,$other_details=null){

  if(isset($old_data['id'])){
    //unset($old_data['id']);
    //unset($old_data['created_at']);
    $old_data = json_encode($old_data,JSON_PRETTY_PRINT);
    $update_data = json_encode($update_data,JSON_PRETTY_PRINT);
  }else if($request_type == 'added'){
    $update_data = json_encode($update_data,JSON_PRETTY_PRINT);
  }
  $data = [
    'module_name' => $module_name,
    'module_id' => $module_id,
    'user_id' => auth()->id(),
    'request_type' => $request_type,
    'old_data' => $old_data,
    'update_data' => $update_data,
    'other_details' => $other_details,
    'created_at' => \Carbon\Carbon::now()
  ];
  History::create($data);

select * from `users` where `active` = '1' and `users`.`deleted_at` is null order by `email` asc
---
function getSellers() {
  $sellers = [];
  if(userRole() == 'leader'){
    $id = auth()->id();
    $sellers = User::where(function($q) use($id){
                      $q->where('leader',$id);
                      $q->OrWhere('id',$id);
                    })
                    ->where('active','1')->get();
  }elseif(userRole() == 'admin' || userRole() == 'sales admin uae' || userRole() == 'sales admin saudi' || userRole() == 'digital marketing' || userRole() == 'ceo'){ //Updated by Javed

    if(userRole() == 'sales admin uae' || userRole() == 'sales admin saudi' ){
      $whereCountry = '';
      if(userRole() == 'sales admin uae'){
        $whereCountry = 'Asia/Dubai';
        $sellers = User::where(function($q){
          $q->where('rule','sales');
          $q->orWhere('rule','leader');
          $q->orWhere('rule','sales director');
        })
        ->where('active','1')
        ->where('time_zone','like','%'.$whereCountry.'%')
        ->orderBy('email','asc')
        ->get();