app/Imports/ContactsImport.php

             $leader = userRole() == 'leader' ? auth()->id() :  auth()->user()->leader;


            $countryCode = Country::where('id',$contact['country'])->first();
---
select * from `countries` where `id` = 'Saudi Arabia' limit 1

        foreach($contactsData as $contact) {
          $contact = $contact->toArray();
          // get new status
          $status = Status::where('name_en','new')->first();
---
select * from `statuses` where `name_en` = 'new' limit 1

          $contact['status_id'] = $status->id;
          $contact['created_from'] = 'import file';

          $contact = Contact::create($contact);
---
insert into `contacts` (`first_name`, `last_name`, `email`, `phone`, `scound_phone`, `budget`, `currency`, `project_id`, `last_mile_conversion`, `lead_type`, `campaign`, `source`, `medium`, `lang`, `purpose`, `purpose_type`, `unit_country`, `unit_city`, `unit_zone`, `content`, `country_id`, `city_id`, `user_id`, `created_by`, `status_id`, `created_from`, `updated_at`, `created_at`) values ('mostfa', 'mohammed', 'mostfamohammed@mail.com', '2010145834234', '201014583425', '1000', 'usa', 1, 1, 'cold', '1', '2', '3', 'arabic', 'rent', 'Villa', 1, 1, '1212', 'test', 1, 1, 13, 13, 2, 'import file', '2022-11-03 09:12:58', '2022-11-03 09:12:58')