app/Imports/DatabaseImport.php

insert into `database_records` (`name`, `email`, `phone`, `city`, `area`, `building_name`, `unit_name`, `price`, `bedroom`, `local_phone_no_or_reference`, `options`, `response`, `community`, `sub_community`, `developer`, `status`, `comment`, `created_by`, `assign_to`, `country_id`, `project_id`, `updated_at`, `created_at`) values ('User', 'contact@yopmail.com', 598333, 'dubai', 'dubai', 'emm', '19 A', 25342, 2, '8798798', 'buy', 'intrested', 'demo', 'demo', 'demo', 2, 'demo', 205, 205, 2, 'emmar', '2022-12-13 06:08:28', '2022-12-13 06:08:28')
---
    public function collection(Collection $rows)
    {
      $contactsData = $rows->slice(0);
      $rowsArray = $contactsData->toArray();

      foreach($contactsData as $index => $contact) {
        $index++;
        $contact = $contact->toArray();
        // get new status
        $country_id = $this->getID($index,'Country','name_en',$contact['country_name']);
        $contact['country_id'] = $country_id;
        $developer_id = $this->getID($index,'Agent','email',$contact['agent_email']);
        $contact['developer_id'] = $developer_id;
        $contact['project_id'] = $contact['project_name'];
        // added by fazal
        $contact['created_by']=auth()->id();
        $contact['assign_to']=auth()->id();
        $contact['status']=2;
        // end
        unset($contact['country_name']); // remove asssigned to => replaced with user_id
        unset($contact['agent_email']);
        unset($contact['project_name']);
        $contact = DatabaseRecords::create(array_filter($contact));