app/Http/Controllers/HomeController.php

    public function login(Request $req)
    {

        $data = $req->validate([
            'email' => 'required|email',
            'password' => 'required'
        ]);

        $remember_me = ! empty($req->remember); // checkbox remmeber
        $data['active'] = '1';

        // check data
        if(auth()->guard()->attempt($data,$remember_me))
        {
          User::where('id',auth()->id())->update([
            'last_login' => Carbon::now()->toDateTimeString()
          ]);
---
update `users` set `last_login` = '2022-12-13 06:34:43', `users`.`updated_at` = '2022-12-13 06:34:43' where `id` = 222 and `users`.`deleted_at` is null