app/Http/Controllers/Admin/AccountsController.php

    public function index()
    {
        if(Request()->has('active') && (Request('active') == '0' || Request('active') == '1')){
            $users = User::where('active',Request('active'));
            $users_count = User::where('active',Request('active'));
            if(Request()->has('search')){
                $users = $users->where('email','LIKE','%'. Request('search') .'%');
                $users_count = $users->where('email','LIKE','%'. Request('search') .'%');
            }
            $users = $users->paginate(20);
            $users_count = $users_count->count();
        }else{
            if(Request()->has('search')){
                $users = User::where('email','LIKE','%'. Request('search') .'%')->paginate(20);
                $users_count = User::where('email','LIKE','%'. Request('search') .'%')->count();
            }else{
                $users = User::paginate(20);
                $users_count = User::count();
            }
        }

        $countries = Country::orderBy('name_en')->get();
---
select * from `users` where `users`.`deleted_at` is null limit 20 offset 0
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select * from `countries` order by `name_en` asc

            $countries->prepend($topCountry);
        }

        $leaders = User::where('rule','leader')->where('active','1')->get();
        $positions = ['rent','buy','sell','management','handover'];
        $roles = Role::pluck('name','name')->all();
---
select * from `users` where `rule` = 'leader' and `active` = '1' and `users`.`deleted_at` is null
select `name`, `name` from `roles`

    public function update(Request $request, $id)
    {

        $user = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '13' and `users`.`deleted_at` is null limit 1


        addHistory('User',$id,'updated',$data,$user);

        $user->update($data);
        if($data['rule'] == 'sales'){
            $data['rule']  = 'sales';
        }
        \DB::table('model_has_roles')->where('model_id',$id)->delete();
---
update `users` set `rule` = 'sales admin uae', `position_types` = '[\"rent\",\"buy\",\"sell\",\"management\"]', `users`.`updated_at` = '2022-11-03 06:09:34' where `id` = 13
delete from `model_has_roles` where `model_id` = '13'