app/Http/Controllers/Admin/ContactController.php

select * from `contacts` where `contacts`.`id` = '65614' and `contacts`.`deleted_at` is null limit 1
---
  public function show( $contact)
  {
      $contact = Contact::findOrFail($contact);

select * from `projects` where `name_en` = 'others'
---


      $currencyName = app()->getLocale() == 'en' ? 'currency' : 'currency_ar';
     $projects = Project::where('name_en','others')
                            ->get();

select * from `statuses` where `active` = '1' order by `weight` asc
---
                          ->orderBy('name_'. app()->getLocale())
                          ->get();

     $status = Status::where('active','1')->orderBy('weight','ASC')->get();

select * from `countries` order by `name_en` asc
---

     // Start Hundel Counties Sort

        $countries = Country::orderBy('name_en')->get();

select * from `purpose_types` order by `type` asc
select * from `currencies` order by `currency` asc
---
       }
     // End Hundel Counties Sort

      $purposetype = PurposeType::orderBy('type')->get();
      $currencies = Currency::orderBy($currencyName)->get();

select * from `activities` where `contact_id` = 65614 order by `id` desc
select * from `tasks` where `contact_id` = 65614 order by `created_at` desc
select * from `notes` where `contact_id` = 65614 order by `created_at` desc
select * from `logs` where `contact_id` = 65614 order by `created_at` desc
select * from `logs` where `contact_id` = 65614 order by `log_date` desc limit 1
---
      $sellers = getSellers(); // Added by Lokesh on 15-11-2022


      $activities = Activity::where('contact_id',$contact->id)->orderBy('id','DESC')->get();
      $tasks = Task::where('contact_id',$contact->id)->orderBy('created_at','DESC')->get();
      $notes = Note::where('contact_id',$contact->id)->orderBy('created_at','DESC')->get();
      $logs = Log::where('contact_id',$contact->id)->orderBy('created_at','DESC')->get();


      $LastConnected = Log::where('contact_id',$contact->id)->orderBy('log_date','DESC')->first();

select * from `campaigns` where `active` = '1' order by `name` asc
select * from `contents` where `active` = '1' order by `name` asc
select * from `sources` where `active` = '1' order by `name` asc
select * from `mediums` where `active` = '1'
---
        'durations' => $durations,
        'currencies' => $currencies,
        'purposetype' => $purposetype,
        'campaigns' => Campaing::where('active','1')->orderBy('name')->get(),
        'contents' => Content::where('active','1')->orderBy('name')->get(),
        'sources' => Source::where('active','1')->orderBy('name')->get(),
        'mediums' => Medium::where('active','1')->get(),

select * from `countries` where `id` = '1' limit 1
select * from `cities` where `country_id` = '1'
---
    public function getCities(Request $request)
    {
        if(!$request->country) return false;

        $country = Country::where('id',$request->country)->first();

      $cities = City::where('country_id',$request->country)->get();