app/Http/Controllers/Admin/DatabaseRecordsController.php

  public function index(){


    /********* Get Contacts By The Rule ***********/
    if(userRole() == 'admin' || userRole() == 'sales admin uae' || userRole() == 'sales admin saudi' || userRole() == 'digital marketing'  || userRole() == 'ceo'|| userRole() == 'sales director' || userRole() == 'leader' ){ //Updated by Javed

        if(userRole() == 'sales admin uae'){

          $data = DatabaseRecords::where('country_id',2)->where(function ($q){
            $this->filterPrams($q);
          })->orderBy('created_at','DESC');


          $data_count = $data->count();

          $paginationNo = 20;
          $data = $data->paginate($paginationNo);

        }else if(userRole() == 'sales admin saudi'){
          $data = DatabaseRecords::where('country_id',1)->where(function ($q){
            $this->filterPrams($q);
          })->orderBy('created_at','DESC');

          $data_count = $data->count();

          $paginationNo = 20;
          $data = $data->paginate($paginationNo);
---
select * from `database_records` where `database_records`.`deleted_at` is null order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `database_records` where `database_records`.`deleted_at` is null