app/Http/Controllers/Admin/DatabaseRecordsController.php

select `database_records`.*, `statuses`.`name_en` as `status` from `database_records` inner join `statuses` on `database_records`.`status` = `statuses`.`id` where `database_records`.`deleted_at` is null limit 20 offset 0
select count(*) as aggregate from `database_records` inner join `statuses` on `database_records`.`status` = `statuses`.`id` where `database_records`.`deleted_at` is null
select count(*) as aggregate from `database_records` where `database_records`.`deleted_at` is null
---
    // added by fazal
    if(userRole() == 'admin')
    {
     $data=DatabaseRecords::join('statuses','database_records.status','statuses.id')
                            ->select('database_records.*','statuses.name_en AS status')
                               ->paginate(20);
     $data_count = DatabaseRecords::count();

select count(*) as aggregate from `database_records` where `assign_to` = 222 and `database_records`.`deleted_at` is null
---
    }
    else
    {
     $data=DatabaseRecords::where('assign_to',auth()->id())->paginate(20);

select * from `statuses`
---
  public function create() {
    $countries = $this->getCuntoryList();
    $sellers = getSellers();
    $status =  Status::get();

insert into `database_records` (`country_id`, `name`, `email`, `phone`, `city`, `area`, `project_id`, `building_name`, `unit_name`, `price`, `bedroom`, `local_phone_no_or_reference`, `options`, `response`, `community`, `sub_community`, `developer`, `comment`, `created_at`, `created_by`, `status`, `updated_at`) values ('2', 'one', 'one@yopmail.com', '0556785', 'dubai', '100', 'test', 'tezxt', 'sakjdn', '10000', '2', 'insd', 'buy', 'intrested', 'dubai', 'nil', 'test', '', '2022-12-15 07:05:12', 205, 2, '2022-12-15 07:05:12')
---
      $data['status'] = 2;
      addHistory('Database Records',0,'added',$data);

      $deal = DatabaseRecords::create($data);

select * from `database_records` where `database_records`.`id` = '7' and `database_records`.`deleted_at` is null limit 1
---
  public function update(Request $request,  $id)
  {

    $deal = DatabaseRecords::findOrFail($id);

select * from `database_records` where `database_records`.`id` = '2' and `database_records`.`deleted_at` is null limit 1
select * from `statuses`
select * from `database_notes` where `database_id` = 2 order by `created_at` desc
---
  public function show($deal)
  {
    $data = DatabaseRecords::findOrFail($deal);

    $countries = $this->getCuntoryList();
    $sellers = getSellers();
    $status =  Status::get();
    $notes = DatabaseNote::where('database_id',$data->id)->orderBy('created_at','DESC')->get();

select * from `users` where `id` = '202' and `users`.`deleted_at` is null limit 1
select `id`, `assign_to` from `database_records` where `id` in ('7') and `database_records`.`deleted_at` is null
---
  public function multiple_assign() {
    $data = [];
    if(!request()->ids OR !request()->id) return false;
    $user = User::where('id',request()->id)->first();
    $records = explode(',',request()->ids);
    $records = DatabaseRecords::select('id','assign_to')->whereIn('id',$records)->get();

select * from `countries` order by `name_en` asc
---
  function getCuntoryList(){
    // Start Hundel Counties Sort
    $countries = Country::orderBy('name_en')->get();