app/Http/Controllers/Admin/DealDeveloperController.php

  public function index(){

    if(Request()->has('search')){
      if(!checkLeader()){
        $deals = DealDeveloper::where('country_id',1)->where('name_en','LIKE','%'. Request('search') .'%')->orderBy('id','desc')->paginate(20);
        $deals_count = DealDeveloper::where('country_id',1)->where('name_en','LIKE','%'. Request('search') .'%')->count();
      }elseif(!checkLeaderUae()){
        $deals = DealDeveloper::where('country_id',2)->where('name_en','LIKE','%'. Request('search') .'%')->orderBy('id','desc')->paginate(20);
        $deals_count = DealDeveloper::where('country_id',2)->where('name_en','LIKE','%'. Request('search') .'%')->count();
      }else{
        $deals = DealDeveloper::where('name_en','LIKE','%'. Request('search') .'%')->orderBy('id','desc')->paginate(20);
        $deals_count = DealDeveloper::where('name_en','LIKE','%'. Request('search') .'%')->count();

      }

    }else{
      if(!checkLeader()){
        $deals = DealDeveloper::where('country_id',1)->orderBy('id','desc')->paginate(20);
        $deals_count = DealDeveloper::where('country_id',1)->count();
      }elseif(!checkLeaderUae()){
        $deals = DealDeveloper::where('country_id',2)->orderBy('id','desc')->paginate(20);
        $deals_count = DealDeveloper::where('country_id',2)->count();
      }else{
        $deals = DealDeveloper::orderBy('id','desc')->paginate(20);
        $deals_count = DealDeveloper::count();
---
select * from `developer` where `developer`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `developer` where `developer`.`deleted_at` is null