app/Http/Controllers/Admin/DealController.php

      ->where('active','1')->orderBy('email')->get();

    }elseif(!checkLeaderUae()){
        $sellers = User::where('time_zone','Asia/Dubai')->where(function($q){
          $q->whereIn('rule',['sales','leader','sales director']);
        })
      ->where('active','1')->orderBy('email')->get();
---
select * from `users` where (`rule` = 'leader' and `active` = '1' or `email` = 'omar.ali@madaproperties.com') and `users`.`deleted_at` is null order by `email` asc

      }

      if(!checkLeader()){
        $developer = DealDeveloper::where('country_id',1)->orderBy('name_en')->get();
---
select * from `developer` where `country_id` = 2 and `developer`.`deleted_at` is null order by `name_en` asc