app/Http/Controllers/Admin/DealDeveloperController.php

select * from `developer` where `developer`.`deleted_at` is null order by `id` desc limit 20 offset 0
select count(*) as aggregate from `developer` where `developer`.`deleted_at` is null
---
    //

      else{
        $deals = DealDeveloper::orderBy('id','desc')->paginate(20);