app/Http/Controllers/Admin/DealProjectController.php

  public function index(){

    if(Request()->has('search')){
      if(!checkLeader()){
        $deals = DealProject::where('country_id',1)->where('project_name','LIKE','%'. Request('search') .'%')->orderBy('id','desc')->paginate(20);
        $deals_count = DealProject::where('country_id',1)->where('project_name','LIKE','%'. Request('search') .'%')->count();
      }elseif(!checkLeaderUae()){
        $deals = DealProject::where('country_id',2)->where('project_name','LIKE','%'. Request('search') .'%')->orderBy('id','desc')->paginate(20);
        $deals_count = DealProject::where('country_id',2)->where('project_name','LIKE','%'. Request('search') .'%')->count();
      }else{
        $deals = DealProject::where('project_name','LIKE','%'. Request('search') .'%')->orderBy('id','desc')->paginate(20);
        $deals_count = DealProject::where('project_name','LIKE','%'. Request('search') .'%')->count();

      }

    }else{
      if(!checkLeader()){
        $deals = DealProject::where('country_id',1)->orderBy('id','desc')->paginate(20);
        $deals_count = DealProject::where('country_id',1)->count();
      }elseif(!checkLeaderUae()){
        $deals = DealProject::where('country_id',2)->orderBy('id','desc')->paginate(20);
        $deals_count = DealProject::where('country_id',2)->count();
      }
      //
      elseif(userRole()=='sales director')
      {
        $user_loc=User::where('id',auth()->id())->first();
---
select * from `users` where `id` = 13 and `users`.`deleted_at` is null limit 1

        }
         else
          {
           $deals = DealProject::where('country_id',2)->orderBy('id','desc')->paginate(20);
           $deals_count = DealProject::where('country_id',2)->count();
---
select * from `deal_projects` where `country_id` = 2 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `deal_projects` where `country_id` = 2