app/Http/Controllers/Admin/DealController.php

  public function index(){

    if(Request()->has('search') || Request()->has('ADVANCED')){
      $data = Deal::where(function ($q){
        $this->filterPrams($q);
      })->orderBy('deal_date','desc');

      if(!checkLeader()){
        $data = $data->where('unit_country',1);
      }elseif(!checkLeaderUae()){
        $data = $data->where('unit_country',2);
      }
      $deals_count = $data->count();
      $deals = $data->paginate(20);
      //$deals = Deal::where('unit_name','LIKE','%'. Request('search') .'%')->orderBy('deal_date','desc')->paginate(20);
      //$deals_count = Deal::where('unit_name','LIKE','%'. Request('search') .'%')->count();

    }else{
      if(!checkLeader()){
        $deals = Deal::orderBy('deal_date','desc')->where('unit_country',1)->paginate(20);
        $deals_count = Deal::where('unit_country',1)->count();
      }elseif(!checkLeaderUae()){
        $deals = Deal::orderBy('deal_date','desc')->where('unit_country',2)->paginate(20);
        $deals_count = Deal::where('unit_country',2)->count();
      }else{
        $deals = Deal::orderBy('deal_date','desc')->paginate(20);
        $deals_count = Deal::count();
      }
    }

    $countries = Country::orderBy('name_en')->get();
---
select * from `deals` where `deals`.`deleted_at` is null order by `deal_date` desc limit 20 offset 0
select count(*) as aggregate from `deals` where `deals`.`deleted_at` is null
select * from `countries` order by `name_en` asc

    if(count($purpose) == 1 AND $purpose[0] == 'sell'){
        $purpose[0] = 'buy';
    }
    $purposetype = PurposeType::orderBy('type')->get();
    $currencyName = app()->getLocale() == 'en' ? 'currency' : 'currency_ar';
    $currencies = Currency::orderBy($currencyName)->get();

    $campaigns = Campaing::where('active','1')->get();
    $contents = Content::where('active','1')->get();
    $sources = Source::where('active','1')->orderBy('name')->get();
    $mediums = Medium::where('active','1')->get();
---
select * from `purpose_types` order by `type` asc
select * from `currencies` order by `currency` asc
select * from `contents` where `active` = '1'
select * from `sources` where `active` = '1' order by `name` asc
select * from `mediums` where `active` = '1'

      })
    ->where('active','1')->get();
    }else{
      $sellers = User::where('rule','sales')->orWhere('rule','leader')
    ->where('active','1')->get();
---
select * from `users` where (`rule` = 'sales' or `rule` = 'leader' and `active` = '1') and `users`.`deleted_at` is null

      $leaders = User::where('rule','leader')
      ->where('active','1')->where('time_zone','Asia/Dubai')->get();
    }else{
      $leaders = User::where('rule','leader')
      ->where('active','1')->get();
---
select * from `users` where (`rule` = 'leader' and `active` = '1' or `email` = 'omar.ali@madaproperties.com') and `users`.`deleted_at` is null

    }elseif(!checkLeaderUae()){
      $developer = DealDeveloper::where('country_id',2)->get();
    }else{
      $developer = DealDeveloper::get();
    }
    $projects = DealProject::get();
---
select * from `developer` where `developer`.`deleted_at` is null
select * from `deal_projects`

  public function create()
  {

    $currencyName = app()->getLocale() == 'en' ? 'currency' : 'currency_ar';

      $projects = Project::where('name_en','others')
                          ->get();



      $miles = LastMileConversion::where('active','1')
                          ->orderBy('name_'. app()->getLocale())
                          ->get();

      $status = Status::where('active','1')->orderBy('weight','DESC')->get();

      $purpose  = auth()->user()->position_types;
      $purpose  = json_decode($purpose);


      if(count($purpose) == 1 AND $purpose[0] == 'sell')
      {
          $purpose[0] = 'buy';
      }

      // Start Hundel Counties Sort

      $countries = Country::orderBy('name_en')->get();
---
select * from `projects` where `name_en` = 'others'
select * from `statuses` where `active` = '1' order by `weight` desc
select * from `countries` order by `name_en` asc

    // End Hundel Counties Sort


      $purposetype = PurposeType::orderBy('type')->get();
      $currencies = Currency::orderBy($currencyName)->get();
---
select * from `purpose_types` order by `type` asc
select * from `currencies` order by `currency` asc



      $campaigns = Campaing::where('active','1')->get();
      $contents = Content::where('active','1')->get();
      $sources = Source::where('active','1')->orderBy('name')->get();
      $mediums = Medium::where('active','1')->get();
---
select * from `contents` where `active` = '1'
select * from `sources` where `active` = '1' order by `name` asc
select * from `mediums` where `active` = '1'

        })
      ->where('active','1')->orderBy('email')->get();
      }else{
        $sellers = User::where('rule','sales')->orWhere('rule','leader')
      ->where('active','1')->orderBy('email')->get();
---
select * from `users` where (`rule` = 'sales' or `rule` = 'leader' and `active` = '1') and `users`.`deleted_at` is null order by `email` asc

        $leaders = User::where('rule','leader')
        ->where('active','1')->where('time_zone','Asia/Dubai')->orderBy('email')->get();
      }else{
        $leaders = User::where('rule','leader')
        ->where('active','1')->orderBy('email')->get();
---
select * from `users` where (`rule` = 'leader' and `active` = '1' and `time_zone` = 'Asia/Dubai' or `email` = 'omar.ali@madaproperties.com') and `users`.`deleted_at` is null order by `email` asc

      }elseif(!checkLeaderUae()){
        $developer = DealDeveloper::where('country_id',2)->orderBy('name_en')->get();
      }else{
        $developer = DealDeveloper::orderBy('name_en')->get();
---
select * from `developer` where `country_id` = 2 and `developer`.`deleted_at` is null order by `name_en` asc