app/Http/Controllers/Admin/MainController.php

            ->orderBy('created_at','DESC');
          }else{
            $projectId = Project::where('country_id',1)->pluck('id');
            $contacts = Contact::with(['country','project','creator','user','status'])
                        ->select($this->selectedAttruibutes)->where(function ($q){
              $this->filterPrams($q);
            })
            ->whereIn('project_id',$projectId)
            ->orderBy('created_at','DESC');
---
select count(*) as aggregate from `contacts` where (`status_id` = '2') and exists (select * from `projects` where `contacts`.`project_id` = `projects`.`id` and `projects`.`country_id` = '1') and `contacts`.`deleted_at` is null


        else{

          $contacts = Contact::with(['country','project','creator','user','status'])
                        ->select($this->selectedAttruibutes)->where(function ($q){
                $this->filterPrams($q);
              })->orderBy('created_at','DESC');
---
select count(*) as aggregate from `contacts` where (`status_id` = '2' and `user_id` = 13) and `contacts`.`deleted_at` is null

    }
    //
    else{
      $projects = Project::orderBy('name_en','ASC')->get();
      if(userRole() == 'leader'){
        if(auth()->user()->time_zone == 'Asia/Riyadh'){
          $projects = Project::where('country_id','1')->orderBy('name_en','ASC')->get();
        }else if(auth()->user()->time_zone == 'Asia/Dubai'){
          $projects = Project::where('country_id','2')->orderBy('name_en','ASC')->get();
---
select * from `projects` order by `name_en` asc
select * from `projects` where `country_id` = '1' order by `name_en` asc
select * from `projects` where `country_id` = '2' order by `name_en` asc


    $purpose  = auth()->user()->position_types;
    $purpose  = json_decode($purpose);
    $campaigns=Cache::remember('campaigns', $cacheTime, function () {
      return Campaing::where('active','1')->orderBy('name','ASC')->get();
    });
---
select * from `campaigns` where `active` = '1' order by `name` asc


    $createdBy=$createdBy->orderBy('email')->get();

    $sources=Cache::remember('sources', $cacheTime, function (){
      return Source::where('active','1')->get();
    });

    $purposetype=Cache::remember('purposetype', $cacheTime, function (){
      return PurposeType::orderBy('type')->get();
    });
---
select * from `sources` where `active` = '1'
select * from `purpose_types` order by `type` asc

  private function checkNewStatus(){
    $status = Status::where('name_en','new')->first();
---
select * from `statuses` where `name_en` = 'new' limit 1

  public function statics (){
      $leadsCount = Contact::count();
      $agentsCount = User::where('active','1')->count();
---
select count(*) as aggregate from `contacts` where `contacts`.`deleted_at` is null
select count(*) as aggregate from `users` where `active` = '1' and `users`.`deleted_at` is null