app/Http/Controllers/Admin/MainController.php

select count(*) as aggregate from `contacts` where (`status_id` = '2') and `contacts`.`deleted_at` is null
---

        else{

          $contacts = Contact::with(['country','project','creator','user','status'])
                        ->select($this->selectedAttruibutes)->where(function ($q){
                $this->filterPrams($q);
              })->orderBy('created_at','DESC');

select count(*) as aggregate from `contacts` where (`status_id` = '2') and `user_id` = 13 and `contacts`.`deleted_at` is null
---
        ->whereRaw('JSON_CONTAINS(leader, ?)', [json_encode((string) $leaderId)])
        ->pluck('id');

        $contacts = Contact::with(['country','project','creator','user','status'])
                        ->select($this->selectedAttruibutes)
                        ->whereIn('user_id',$usersIds)

select * from `users` where `id` = 13 and `users`.`deleted_at` is null limit 1
---
      $contacts = $contacts->paginate(20);

    }else if(userRole() == 'sales director') { // sales director
      $userloc=User::where('id',auth()->id())->first();

select count(*) as aggregate from `contacts` where `contacts`.`deleted_at` is null
---
           $users = User::select('id')->where('active','1')->where('time_zone','Asia/Riyadh')->get();  // updated by fazal 07-12-23
           $usersIds = $users->pluck('id')->toArray();
          $projectId = Project::where('country_id',1)->pluck('id');
          $contacts = Contact::with(['country','project','creator','user','status'])
                        ->select($this->selectedAttruibutes)->where(function ($q){
            $this->filterPrams($q);
          })->whereIn('user_id',$usersIds)
          ->orderBy('created_at','DESC');

select * from `statuses` where `active` = '1' order by `weight` asc
---

    $sellers= getSellers(); // Added by Lokesh on 15-11-2022

    $status=Cache::remember('status', $cacheTime, function () {
      return Status::where('active','1')->orderBy('weight','ASC')->get();
    });

select * from `countries` order by `name_en` asc
---

    // Start Hundel Counties Sort

    $countries=Cache::remember('countries', $cacheTime, function () {
      return Country::orderBy('name_en')->get();
    });