app/Http/Controllers/Admin/MainController.php

select count(*) as aggregate from `contacts` where `unit_country` = 2 and `contacts`.`deleted_at` is null
---
          })->where('unit_country',2)
          ->orderBy('created_at','DESC');
        }else{
          $contacts = Contact::select($this->selectedAttruibutes)->where(function ($q){
            $this->filterPrams($q);
          })->where('unit_country',1)
          ->orderBy('created_at','DESC');

select * from `statuses` where `active` = '1' order by `weight` asc
---

    $sellers = getSellers(); // Added by Lokesh on 15-11-2022

    $status = Status::where('active','1')->orderBy('weight','ASC')->get();

select * from `countries` order by `name_en` asc
---

    // Start Hundel Counties Sort

    $countries = Country::orderBy('name_en')->get();

select * from `projects` order by `name_en` asc
---
    }else if(userRole() == 'sales admin uae'){  //Added by Javed
      $projects = Project::where('country_id','2')->orderBy('name_en','ASC')->get();
    }else{
      $projects = Project::orderBy('name_en','ASC')->get();

select * from `projects` where `country_id` = '1' order by `name_en` asc
---
        if(auth()->user()->time_zone == 'Asia/Riyadh'){
          $projects = Project::where('country_id','1')->orderBy('name_en','ASC')->get();
        }else if(auth()->user()->time_zone == 'Asia/Dubai'){
          $projects = Project::where('country_id','2')->orderBy('name_en','ASC')->get();

select * from `sources` where `active` = '1'
select * from `purpose_types` order by `type` asc
---

    $createdBy = $createdBy->orderBy('email')->get();

    $sources = Source::where('active','1')->get();

    $purposetype = PurposeType::orderBy('type')->get();

select * from `statuses` where `name_en` = 'new' limit 1
---
  private function checkNewStatus(){
    $status = Status::where('name_en','new')->first();