app/Http/Controllers/Admin/ProjectDataController.php

  public function index(){

    if(Request()->has('search') || Request()->has('ADVANCED')){
      $data = ProjectData::where(function ($q){
        $this->filterPrams($q);
      })->orderBy('id','desc');

      if(!checkLeader()){
        $data = $data->where('country_id',1);
      }elseif(!checkLeaderUae()){
        $data = $data->where('country_id',2);
      }
      $data_count = $data->count();
      $data = $data->paginate(20);
    }else{
      if(!checkLeader()){
        $data = ProjectData::where('country_id',1)->orderBy('id','desc')->paginate(20);
        $data_count = ProjectData::where('country_id',1)->count();
      }elseif(!checkLeaderUae()){
        $data = ProjectData::where('country_id',2)->orderBy('id','desc')->paginate(20);
        $data_count = ProjectData::where('country_id',2)->count();
      }else{
        $data = ProjectData::orderBy('id','desc')->paginate(20);
        $data_count = ProjectData::count();
      }
    }
    $projects = ProjectName::orderBy('name','ASC')->get();
    $developer = ProjectDeveloper::orderBy('name','ASC')->get();
    $purposetype = PurposeType::orderBy('type')->get();
---
select * from `purpose_types` order by `type` asc

  public function create()
  {
    $countries = Country::orderBy('name_en')->get();

    $collectCounties = [];
    $collectCounties = collect($collectCounties);

    foreach($countries as $index => $country)
    {
        if(in_array($country->name_en,toCountriess()) )
        {
            $collectCounties->push($country);
        }
    }


    $countries = $countries->filter(function($item) {
      return !in_array($item->name_en,toCountriess());
    });


    foreach($collectCounties as $topCountry)
    {
        $countries->prepend($topCountry);
    }
    // End Hundel Counties Sort
    $purposetype = PurposeType::orderBy('type')->get();
---
select * from `countries` order by `name_en` asc
select * from `purpose_types` order by `type` asc

  public function show($id)
  {
    $projectdata = ProjectData::findOrFail($id);
    // Start Hundel Counties Sort
    $countries = Country::orderBy('name_en')->get();

    $collectCounties = [];
    $collectCounties = collect($collectCounties);

    foreach($countries as $index => $country)
    {
        if(in_array($country->name_en,toCountriess()) )
        {
            $collectCounties->push($country);
        }
    }


    $countries = $countries->filter(function($item) {
      return !in_array($item->name_en,toCountriess());
    });


    foreach($collectCounties as $topCountry)
    {
        $countries->prepend($topCountry);
    }
    $purposetype = PurposeType::orderBy('type')->get();
---
select * from `countries` order by `name_en` asc
select * from `purpose_types` order by `type` asc