app/Http/Controllers/Admin/ProjectsController.php

    public function getProjects(Request $request)
    {
        if(!$request->country) return false;

        $country = Country::where('id',$request->country)->first();

      $rows = Project::where('country_id',$request->country)
                            ->orderBy('name_en','ASC')
                            ->get();


    $others = Project::where('name_en','others')
    ->first();
---
select * from `countries` where `id` = '2' limit 1
select * from `projects` where `country_id` = '2' order by `name_en` asc
select * from `projects` where `name_en` = 'others' limit 1