app/Http/Controllers/Admin/ReportController.php

select `id`, `rule`, `leader`, `email` from `users` where `active` = '1' and `rule` = 'leader' and `users`.`deleted_at` is null
select `id`, `rule`, `leader` from `users` where (`leader` = 17 or `id` = 17) and `users`.`deleted_at` is null
---
	public function reportLeaders(){ // leaders

		if(Request('type') AND request('type') == 'leaders'){
			$leaders = User::select('id','rule','leader','email')->where('active','1')->where('rule','leader');
			if(userRole() == 'sales admin saudi'){
				$whereCountry = 'Asia/Riyadh';
				$leaders = $leaders->where('time_zone','like','%'.$whereCountry.'%');
			}else if(userRole() == 'sales admin uae'){
				$whereCountry = 'Asia/Dubai';
				$leaders = $leaders->where('time_zone','like','%'.$whereCountry.'%');
			}
			$leaders = $leaders->get();

			foreach($leaders as $lead){
				$leaderTeam = User::select('id','rule','leader')
							->where('leader',$lead->id)
							->orWhere('id',$lead->id)->get();

select * from `users` where `users`.`id` = '164' and `users`.`deleted_at` is null limit 1
select `id`, `user_id`, `status_id`, `status_changed_at` from `contacts` where `user_id` = '164' and date(`updated_at`) <= '2022-10-20' and `contacts`.`deleted_at` is null
select `id`, `user_id`, `status_id`, `status_changed_at` from `contacts` where `user_id` = '164' and date(`updated_at`) >= '2022-10-20' and `contacts`.`deleted_at` is null
---
	public function reportUsers(){ // reportUsers

		$canvas = false;
		$weekends = 0;
		$report_dates = [];
		$user = [];
		$activities = [];
		$status_not_changed_after_48_hours = [];
		$canvas = true;
		$user_contacts = [];
		$status_not_changed_after_1_week = [];
		$allUsersReport = false;
		$userReport = [];
		$two_week_report = [];

		if(userRole()!='sales director' && request('users_id') && request()->has('from') && request()->has('to')){
		  $from = date('Y-m-d 00:00:00', strtotime(Request('from')));
			$to = date('Y-m-d 23:59:59', strtotime(Request('to')));

			$user_id = Request('users_id');
			// get the User
			$user = User::findOrFail($user_id);
			// get logs
			$activities = Log::where('user_id',$user_id)
								//->where('is_log','1')
								->whereBetween('log_date',[ $from,$to ])
								->get();
			$status_not_changed_after_1_week = Contact::select('id','user_id','status_id','status_changed_at')
			->where('user_id',$user_id)
			->whereDate('updated_at', '<=', Carbon::today()->subDays( 14 ))
			->get();

			$two_week_report = Contact::select('id','user_id','status_id','status_changed_at')
			->where('user_id',$user_id)
			->whereDate('updated_at', '>=', Carbon::today()->subDays( 14 ))
			->get();

select * from `users` where `id` = 13 and `users`.`deleted_at` is null limit 1
---
		if(userRole()=='sales director')
		{

			$userdetail=User::where('id',auth()->id())->first();

select * from `statuses` where `active` = '1'
select * from `countries`
select * from `users` where `id` = 13 and `users`.`deleted_at` is null limit 1
---
		->orderBy('email')->get();


		$status = Status::where('active','1')->get();
        $countries=Country::get();
        if(userRole()=='sales director')
        {
        	$userdetail=User::where('id',auth()->id())->first();

select `id`, `created_from`, DATE(created_at) AS created_at from `contacts` where `created_at` between '2022-10-31 03:13:33' and '2022-11-04 06:13:33' and `contacts`.`deleted_at` is null group by `created_at` order by `id` asc
---
	public function reportDaily(){ // reportUsers
		$canvas = true;
		$weekends = 0;

		if(request()->has('type') AND request('type') == 'report'){
			$from = Request('from') ? Carbon::parse(Request('from')) : Carbon::parse('-100 hours');
			$to = Request('to') ? Carbon::parse(Request('to')) : Carbon::parse('-1 hours');

			$contacts = Contact::select('id','created_from',DB::raw('DATE(created_at) AS created_at'))
							->whereBetween('created_at',[$from,$to])
							->orderBy('id','ASC')
							->groupBy('created_at')
							->get();

select DATE(created_at) AS created_at from `contacts` where `contacts`.`deleted_at` is null
---
			}

			$created_at_dats = collect(array_values($created_at_dats));
			$created_at_dats2 = Contact::select(DB::raw('DATE(created_at) AS created_at'))->pluck('created_at');

select * from `statuses` where `active` = '1'
---

		}

		$status = Status::where('active','1')->get();